ir_version: 6
producer_name: "pytorch"
producer_version: "1.9"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "src"
    output: "384"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "385"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "384"
    input: "385"
    output: "386"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "386"
    output: "387"
    name: "Cast_3"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "388"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "387"
    input: "388"
    output: "389"
    name: "Mul_5"
    op_type: "Mul"
  }
  node {
    input: "389"
    output: "390"
    name: "Cast_6"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "390"
    output: "391"
    name: "Floor_7"
    op_type: "Floor"
  }
  node {
    input: "src"
    output: "392"
    name: "Shape_8"
    op_type: "Shape"
  }
  node {
    output: "393"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "392"
    input: "393"
    output: "394"
    name: "Gather_10"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "394"
    output: "395"
    name: "Cast_11"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "396"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "395"
    input: "396"
    output: "397"
    name: "Mul_13"
    op_type: "Mul"
  }
  node {
    input: "397"
    output: "398"
    name: "Cast_14"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "398"
    output: "399"
    name: "Floor_15"
    op_type: "Floor"
  }
  node {
    input: "391"
    output: "400"
    name: "Unsqueeze_16"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "399"
    output: "401"
    name: "Unsqueeze_17"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "400"
    input: "401"
    output: "402"
    name: "Concat_18"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "src"
    output: "403"
    name: "Shape_19"
    op_type: "Shape"
  }
  node {
    output: "404"
    name: "Constant_20"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "405"
    name: "Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "406"
    name: "Constant_22"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "403"
    input: "405"
    input: "406"
    input: "404"
    output: "407"
    name: "Slice_23"
    op_type: "Slice"
  }
  node {
    input: "402"
    output: "408"
    name: "Cast_24"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "407"
    input: "408"
    output: "409"
    name: "Concat_25"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "410"
    name: "Constant_26"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "411"
    name: "Constant_27"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "src"
    input: "410"
    input: "411"
    input: "409"
    output: "412"
    name: "Resize_28"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "bgr"
    output: "413"
    name: "Shape_29"
    op_type: "Shape"
  }
  node {
    output: "414"
    name: "Constant_30"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "413"
    input: "414"
    output: "415"
    name: "Gather_31"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "415"
    output: "416"
    name: "Cast_32"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "417"
    name: "Constant_33"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "416"
    input: "417"
    output: "418"
    name: "Mul_34"
    op_type: "Mul"
  }
  node {
    input: "418"
    output: "419"
    name: "Cast_35"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "419"
    output: "420"
    name: "Floor_36"
    op_type: "Floor"
  }
  node {
    input: "bgr"
    output: "421"
    name: "Shape_37"
    op_type: "Shape"
  }
  node {
    output: "422"
    name: "Constant_38"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "421"
    input: "422"
    output: "423"
    name: "Gather_39"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "423"
    output: "424"
    name: "Cast_40"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "425"
    name: "Constant_41"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "424"
    input: "425"
    output: "426"
    name: "Mul_42"
    op_type: "Mul"
  }
  node {
    input: "426"
    output: "427"
    name: "Cast_43"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "427"
    output: "428"
    name: "Floor_44"
    op_type: "Floor"
  }
  node {
    input: "420"
    output: "429"
    name: "Unsqueeze_45"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "428"
    output: "430"
    name: "Unsqueeze_46"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "429"
    input: "430"
    output: "431"
    name: "Concat_47"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "bgr"
    output: "432"
    name: "Shape_48"
    op_type: "Shape"
  }
  node {
    output: "433"
    name: "Constant_49"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "434"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "435"
    name: "Constant_51"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "432"
    input: "434"
    input: "435"
    input: "433"
    output: "436"
    name: "Slice_52"
    op_type: "Slice"
  }
  node {
    input: "431"
    output: "437"
    name: "Cast_53"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "436"
    input: "437"
    output: "438"
    name: "Concat_54"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "439"
    name: "Constant_55"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "440"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "bgr"
    input: "439"
    input: "440"
    input: "438"
    output: "441"
    name: "Resize_57"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "412"
    input: "441"
    output: "442"
    name: "Concat_58"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "442"
    input: "1445"
    input: "1446"
    output: "1444"
    name: "Conv_59"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "445"
    name: "Constant_60"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "446"
    name: "Constant_61"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1444"
    input: "445"
    input: "446"
    output: "447"
    name: "Clip_62"
    op_type: "Clip"
  }
  node {
    input: "447"
    input: "1448"
    input: "1449"
    output: "1447"
    name: "Conv_63"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 32
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "450"
    name: "Constant_64"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "451"
    name: "Constant_65"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1447"
    input: "450"
    input: "451"
    output: "452"
    name: "Clip_66"
    op_type: "Clip"
  }
  node {
    input: "452"
    input: "1451"
    input: "1452"
    output: "1450"
    name: "Conv_67"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1450"
    input: "1454"
    input: "1455"
    output: "1453"
    name: "Conv_68"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "457"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "458"
    name: "Constant_70"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1453"
    input: "457"
    input: "458"
    output: "459"
    name: "Clip_71"
    op_type: "Clip"
  }
  node {
    input: "459"
    input: "1457"
    input: "1458"
    output: "1456"
    name: "Conv_72"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 96
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "462"
    name: "Constant_73"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "463"
    name: "Constant_74"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1456"
    input: "462"
    input: "463"
    output: "464"
    name: "Clip_75"
    op_type: "Clip"
  }
  node {
    input: "464"
    input: "1460"
    input: "1461"
    output: "1459"
    name: "Conv_76"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1459"
    input: "1463"
    input: "1464"
    output: "1462"
    name: "Conv_77"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "469"
    name: "Constant_78"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "470"
    name: "Constant_79"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1462"
    input: "469"
    input: "470"
    output: "471"
    name: "Clip_80"
    op_type: "Clip"
  }
  node {
    input: "471"
    input: "1466"
    input: "1467"
    output: "1465"
    name: "Conv_81"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "474"
    name: "Constant_82"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "475"
    name: "Constant_83"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1465"
    input: "474"
    input: "475"
    output: "476"
    name: "Clip_84"
    op_type: "Clip"
  }
  node {
    input: "476"
    input: "1469"
    input: "1470"
    output: "1468"
    name: "Conv_85"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1459"
    input: "1468"
    output: "479"
    name: "Add_86"
    op_type: "Add"
  }
  node {
    input: "479"
    input: "1472"
    input: "1473"
    output: "1471"
    name: "Conv_87"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "482"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "483"
    name: "Constant_89"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1471"
    input: "482"
    input: "483"
    output: "484"
    name: "Clip_90"
    op_type: "Clip"
  }
  node {
    input: "484"
    input: "1475"
    input: "1476"
    output: "1474"
    name: "Conv_91"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "487"
    name: "Constant_92"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "488"
    name: "Constant_93"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1474"
    input: "487"
    input: "488"
    output: "489"
    name: "Clip_94"
    op_type: "Clip"
  }
  node {
    input: "489"
    input: "1478"
    input: "1479"
    output: "1477"
    name: "Conv_95"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1477"
    input: "1481"
    input: "1482"
    output: "1480"
    name: "Conv_96"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "494"
    name: "Constant_97"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "495"
    name: "Constant_98"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1480"
    input: "494"
    input: "495"
    output: "496"
    name: "Clip_99"
    op_type: "Clip"
  }
  node {
    input: "496"
    input: "1484"
    input: "1485"
    output: "1483"
    name: "Conv_100"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "499"
    name: "Constant_101"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "500"
    name: "Constant_102"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1483"
    input: "499"
    input: "500"
    output: "501"
    name: "Clip_103"
    op_type: "Clip"
  }
  node {
    input: "501"
    input: "1487"
    input: "1488"
    output: "1486"
    name: "Conv_104"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1477"
    input: "1486"
    output: "504"
    name: "Add_105"
    op_type: "Add"
  }
  node {
    input: "504"
    input: "1490"
    input: "1491"
    output: "1489"
    name: "Conv_106"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "507"
    name: "Constant_107"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "508"
    name: "Constant_108"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1489"
    input: "507"
    input: "508"
    output: "509"
    name: "Clip_109"
    op_type: "Clip"
  }
  node {
    input: "509"
    input: "1493"
    input: "1494"
    output: "1492"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "512"
    name: "Constant_111"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "513"
    name: "Constant_112"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1492"
    input: "512"
    input: "513"
    output: "514"
    name: "Clip_113"
    op_type: "Clip"
  }
  node {
    input: "514"
    input: "1496"
    input: "1497"
    output: "1495"
    name: "Conv_114"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "504"
    input: "1495"
    output: "517"
    name: "Add_115"
    op_type: "Add"
  }
  node {
    input: "517"
    input: "1499"
    input: "1500"
    output: "1498"
    name: "Conv_116"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "520"
    name: "Constant_117"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "521"
    name: "Constant_118"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1498"
    input: "520"
    input: "521"
    output: "522"
    name: "Clip_119"
    op_type: "Clip"
  }
  node {
    input: "522"
    input: "1502"
    input: "1503"
    output: "1501"
    name: "Conv_120"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "525"
    name: "Constant_121"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "526"
    name: "Constant_122"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1501"
    input: "525"
    input: "526"
    output: "527"
    name: "Clip_123"
    op_type: "Clip"
  }
  node {
    input: "527"
    input: "1505"
    input: "1506"
    output: "1504"
    name: "Conv_124"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1504"
    input: "1508"
    input: "1509"
    output: "1507"
    name: "Conv_125"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "532"
    name: "Constant_126"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "533"
    name: "Constant_127"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1507"
    input: "532"
    input: "533"
    output: "534"
    name: "Clip_128"
    op_type: "Clip"
  }
  node {
    input: "534"
    input: "1511"
    input: "1512"
    output: "1510"
    name: "Conv_129"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "537"
    name: "Constant_130"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "538"
    name: "Constant_131"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1510"
    input: "537"
    input: "538"
    output: "539"
    name: "Clip_132"
    op_type: "Clip"
  }
  node {
    input: "539"
    input: "1514"
    input: "1515"
    output: "1513"
    name: "Conv_133"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1504"
    input: "1513"
    output: "542"
    name: "Add_134"
    op_type: "Add"
  }
  node {
    input: "542"
    input: "1517"
    input: "1518"
    output: "1516"
    name: "Conv_135"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "545"
    name: "Constant_136"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "546"
    name: "Constant_137"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1516"
    input: "545"
    input: "546"
    output: "547"
    name: "Clip_138"
    op_type: "Clip"
  }
  node {
    input: "547"
    input: "1520"
    input: "1521"
    output: "1519"
    name: "Conv_139"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "550"
    name: "Constant_140"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "551"
    name: "Constant_141"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1519"
    input: "550"
    input: "551"
    output: "552"
    name: "Clip_142"
    op_type: "Clip"
  }
  node {
    input: "552"
    input: "1523"
    input: "1524"
    output: "1522"
    name: "Conv_143"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "542"
    input: "1522"
    output: "555"
    name: "Add_144"
    op_type: "Add"
  }
  node {
    input: "555"
    input: "1526"
    input: "1527"
    output: "1525"
    name: "Conv_145"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "558"
    name: "Constant_146"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "559"
    name: "Constant_147"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1525"
    input: "558"
    input: "559"
    output: "560"
    name: "Clip_148"
    op_type: "Clip"
  }
  node {
    input: "560"
    input: "1529"
    input: "1530"
    output: "1528"
    name: "Conv_149"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "563"
    name: "Constant_150"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "564"
    name: "Constant_151"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1528"
    input: "563"
    input: "564"
    output: "565"
    name: "Clip_152"
    op_type: "Clip"
  }
  node {
    input: "565"
    input: "1532"
    input: "1533"
    output: "1531"
    name: "Conv_153"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "555"
    input: "1531"
    output: "568"
    name: "Add_154"
    op_type: "Add"
  }
  node {
    input: "568"
    input: "1535"
    input: "1536"
    output: "1534"
    name: "Conv_155"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "571"
    name: "Constant_156"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "572"
    name: "Constant_157"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1534"
    input: "571"
    input: "572"
    output: "573"
    name: "Clip_158"
    op_type: "Clip"
  }
  node {
    input: "573"
    input: "1538"
    input: "1539"
    output: "1537"
    name: "Conv_159"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 384
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "576"
    name: "Constant_160"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "577"
    name: "Constant_161"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1537"
    input: "576"
    input: "577"
    output: "578"
    name: "Clip_162"
    op_type: "Clip"
  }
  node {
    input: "578"
    input: "1541"
    input: "1542"
    output: "1540"
    name: "Conv_163"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1540"
    input: "1544"
    input: "1545"
    output: "1543"
    name: "Conv_164"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "583"
    name: "Constant_165"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "584"
    name: "Constant_166"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1543"
    input: "583"
    input: "584"
    output: "585"
    name: "Clip_167"
    op_type: "Clip"
  }
  node {
    input: "585"
    input: "1547"
    input: "1548"
    output: "1546"
    name: "Conv_168"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "588"
    name: "Constant_169"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "589"
    name: "Constant_170"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1546"
    input: "588"
    input: "589"
    output: "590"
    name: "Clip_171"
    op_type: "Clip"
  }
  node {
    input: "590"
    input: "1550"
    input: "1551"
    output: "1549"
    name: "Conv_172"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1540"
    input: "1549"
    output: "593"
    name: "Add_173"
    op_type: "Add"
  }
  node {
    input: "593"
    input: "1553"
    input: "1554"
    output: "1552"
    name: "Conv_174"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "596"
    name: "Constant_175"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "597"
    name: "Constant_176"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1552"
    input: "596"
    input: "597"
    output: "598"
    name: "Clip_177"
    op_type: "Clip"
  }
  node {
    input: "598"
    input: "1556"
    input: "1557"
    output: "1555"
    name: "Conv_178"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "601"
    name: "Constant_179"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "602"
    name: "Constant_180"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1555"
    input: "601"
    input: "602"
    output: "603"
    name: "Clip_181"
    op_type: "Clip"
  }
  node {
    input: "603"
    input: "1559"
    input: "1560"
    output: "1558"
    name: "Conv_182"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "593"
    input: "1558"
    output: "606"
    name: "Add_183"
    op_type: "Add"
  }
  node {
    input: "606"
    input: "1562"
    input: "1563"
    output: "1561"
    name: "Conv_184"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "609"
    name: "Constant_185"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "610"
    name: "Constant_186"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1561"
    input: "609"
    input: "610"
    output: "611"
    name: "Clip_187"
    op_type: "Clip"
  }
  node {
    input: "611"
    input: "1565"
    input: "1566"
    output: "1564"
    name: "Conv_188"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "614"
    name: "Constant_189"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "615"
    name: "Constant_190"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1564"
    input: "614"
    input: "615"
    output: "616"
    name: "Clip_191"
    op_type: "Clip"
  }
  node {
    input: "616"
    input: "1568"
    input: "1569"
    output: "1567"
    name: "Conv_192"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1567"
    input: "1571"
    input: "1572"
    output: "1570"
    name: "Conv_193"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "621"
    name: "Constant_194"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "622"
    name: "Constant_195"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1570"
    input: "621"
    input: "622"
    output: "623"
    name: "Clip_196"
    op_type: "Clip"
  }
  node {
    input: "623"
    input: "1574"
    input: "1575"
    output: "1573"
    name: "Conv_197"
    op_type: "Conv"
    attribute {
